import { RawMap } from '@/store/types';

export const sampleMaps: RawMap[] =  [
    {
        id: 0,
        name: '九州大学',
        spots: [
            {
                id: 0,
                name: '総合学習プラザ',
                coordinate: {
                    lat: 33.595502,
                    lng: 130.218238,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21791636943817, 33.59517952985549],
                            [130.21812558174133, 33.59524208725731],
                            [130.2181041240692, 33.595291239469766],
                            [130.21862983703613, 33.595465506179146],
                            [130.2184957265854, 33.59572913976256],
                            [130.2177768945694, 33.59551018989406],
                            [130.21791636943817, 33.59517952985549],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [1, 2],
                detailMapLevelNames: ['1F', '2F'],
                lastViewedDetailMapId: null,
                description: '全学・工学系の共通講義と大学院統合新領域学府オートモーティブサイエンス専攻の教育研究等を行う施設',
                type: 'withDetailMap',
                shouldDisplayNameOnMap: false,
            },
            {
                id: 1,
                name: 'ウエスト2号館',
                coordinate: {
                    lat: 33.59600170923035,
                    lng: 130.21851181983948,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2175676822662, 33.59599724088536],
                            [130.21762669086456, 33.595840848665],
                            [130.21777153015137, 33.59563530417269],
                            [130.2184957265854, 33.59583638031169],
                            [130.2189356088638, 33.59589893723709],
                            [130.21927893161774, 33.59591681063602],
                            [130.2192574739456, 33.59599277254014],
                            [130.21932184696198, 33.59597936750309],
                            [130.21931111812592, 33.5962787461674],
                            [130.21898925304413, 33.59626087284348],
                            [130.21827042102814, 33.596153632822144],
                            [130.21792709827423, 33.596064266035846],
                            [130.2175676822662, 33.59599724088536],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [3, 4, 6],
                detailMapLevelNames: ['2F', '3F', '5F'],
                lastViewedDetailMapId: null,
                description: '見どころスポット：フーコーの振り子',
                type: 'withDetailMap',
                shouldDisplayNameOnMap: false,
            },
            {
                id: 2,
                name: 'ウエスト3号館',
                coordinate: {
                    lat: 33.59574254483849,
                    lng: 130.21705269813538,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21647870540616, 33.59561296235053],
                            [130.2165699005127, 33.595447632686685],
                            [130.21722435951233, 33.595671051076096],
                            [130.21719753742218, 33.59574701319666],
                            [130.21746039390564, 33.59583191195813],
                            [130.2176320552826, 33.5958453170181],
                            [130.2175676822662, 33.59599277254014],
                            [130.217165350914, 33.59589893723709],
                            [130.21647870540616, 33.59561296235053],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
                description: '機械航空工学部門群と物質科学工学部門群が入居する施設であり、ウエスト2号館とウエスト4号館とつながっている',
                shouldDisplayNameOnMap: false,
            },
            {
                id: 3,
                name: 'ウエスト1号館',
                coordinate: {
                    lat: 33.596408327655084,
                    lng: 130.2206951379776,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2191823720932,　33.5962698095059],
                            [130.21931111812592,　33.5962698095059],
                            [130.21931111812592,　33.596350239426066],
                            [130.21974563598633,　33.59637704938279],
                            [130.21982073783872, 33.59615810115904],
                            [130.22070050239563, 33.59619384784579],
                            [130.22162854671478, 33.596461947524084],
                            [130.2216124534607, 33.59647982080635],
                            [130.2216875553131, 33.59651109904137],
                            [130.22156417369843, 33.596801539253576],
                            [130.22149443626404, 33.59678366603799],
                            [130.22146224975586, 33.59681047585999],
                            [130.22062003612518, 33.59663621186807],
                            [130.22023379802704, 33.59658706042208],
                            [130.21981000900269, 33.59656025053064],
                            [130.21976172924042, 33.59652003567786],
                            [130.2191662788391, 33.59650216240394],
                            [130.2191823720932, 33.5962698095059],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
                description: '理学部、理学府、数理学府が入居する施設',
                shouldDisplayNameOnMap: false,
            },
            {
                id: 4,
                name: 'ウエスト4号館',
                coordinate: {
                    lat: 33.5951705930801,
                    lng: 130.2165591716766,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21569550037384, 33.59483993173965],
                            [130.2158510684967, 33.59468800583389],
                            [130.2159744501114, 33.59475056359221],
                            [130.21603882312775, 33.59461204278066],
                            [130.21629631519318, 33.59479077927],
                            [130.21640360355377, 33.594951641793756],
                            [130.21679520606995, 33.59513484596927],
                            [130.21719217300415, 33.595286771087984],
                            [130.21737456321716, 33.59534039165421],
                            [130.2172726392746, 33.59546997455167],
                            [130.2171814441681, 33.59559062052259],
                            [130.2163016796112, 33.5952152769478],
                            [130.2160280942917, 33.59507228848967],
                            [130.21569550037384, 33.59483993173965],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
                description: '2階203号室には工学部教務課が入居している',
                shouldDisplayNameOnMap: false,
            },
            {
                id: 5,
                name: 'マス・フォアインダストリ研究所',
                coordinate: {
                    lat: 33.595291239469766,
                    lng: 130.21962225437161,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21961152553558, 33.59552806337354],
                            [130.21933257579803, 33.5952688975585],
                            [130.2196490764618, 33.595036541338104],
                            [130.21990656852722, 33.595304644613755],
                            [130.21961152553558, 33.59552806337354],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
                description: '現在マス・フォアインダストリー研究所はウエスト1号館に移動し、今は情報基盤研究開発センター棟となっている',
                shouldDisplayNameOnMap: false,
            },
            {
                id: 6,
                name: '伊都理系図書館',
                coordinate: {
                    lat: 33.59575148155462,
                    lng: 130.22006213665009,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21972954273224, 33.59601958260798],
                            [130.21974027156827, 33.59559062052259],
                            [130.21983683109283, 33.59559955725445],
                            [130.21987974643707, 33.59537613867985],
                            [130.22039473056793, 33.59539401218712],
                            [130.2203357219696, 33.59603298763877],
                            [130.21972954273224, 33.59601958260798],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
                description: '多様な学習スペースが設けられており，軽食を提供するカフェ(Libca)が併設されています',
                shouldDisplayNameOnMap: false,
            },
        ],
        nodes: [],
        edges: [],
        bounds: {
            topL: {
                lat: 33.596643,
                lng: 130.215516,
            },
            botR: {
                lat: 33.594083,
                lng: 130.220609,
            },
        },

    },
    {
        id: 1,
        name: '総合学習プラザ 1F',
        floorName: '1F',
        spots: [
            {
                id: 0,
                name: '101',
                coordinate: {
                    lat: 33.59550125315293,
                    lng: 130.21782517433167,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21788418293, 33.59554593684934],
                            [130.21791100502014, 33.595487848039504],
                            [130.21780371665955, 33.59545210106014],
                            [130.21778225898743, 33.59551018989406],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 1,
                name: '102',
                coordinate: {
                    lat: 33.59553700011191,
                    lng: 130.2179378271103,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21800220012665, 33.595581683789796],
                            [130.2180290222168, 33.595523595004025],
                            [130.21791100502014, 33.595487848039504],
                            [130.21788418293, 33.59554593684934],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 2,
                name: '103',
                coordinate: {
                    lat: 33.595617430715414,
                    lng: 130.21824896335602,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21819531917572, 33.59563977253643],
                            [130.21821677684784, 33.59558615215631],
                            [130.21832406520844, 33.5956218990801],
                            [130.2182972431183, 33.59567551943798],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3,
                name: '104',
                coordinate: {
                    lat: 33.5956487092632,
                    lng: 130.21834552288055,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2182972431183, 33.59567551943798],
                            [130.21832406520844, 33.5956218990801],
                            [130.218425989151, 33.595653177626254],
                            [130.21840453147888, 33.595706797964695],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 4,
                name: '105',
                coordinate: {
                    lat: 33.59568445616106,
                    lng: 130.2184635400772,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21840453147888, 33.595706797964695],
                            [130.218425989151, 33.595653177626254],
                            [130.21852254867554, 33.595679987799635],
                            [130.21849036216736, 33.59573360812144],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 5,
                name: '106',
                coordinate: {
                    lat: 33.59523538468072,
                    lng: 130.21795123815536,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2180129289627, 33.59522421371856],
                            [130.21798610687256, 33.59527783432369],
                            [130.21789491176605, 33.595251024025295],
                            [130.2179217338562, 33.59519293501684],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 6,
                name: '107',
                coordinate: {
                    lat: 33.59525772660069,
                    lng: 130.21803706884384,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2181041240692, 33.59525549240893],
                            [130.21807730197906, 33.59531358137526],
                            [130.21798610687256, 33.59527783432369],
                            [130.2180129289627, 33.59522421371856],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 7,
                name: '108',
                coordinate: {
                    lat: 33.59540294893936,
                    lng: 130.21832942962646,
                    },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21832942962646, 33.59537167030247],
                            [130.21830260753632, 33.595425290815925],
                            [130.21840453147888, 33.59545210106014],
                            [130.21843135356903, 33.59540294893936],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 8,
                name: '109',
                coordinate: {
                    lat: 33.59541970534731,
                    lng: 130.21845281124112,
                    },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21843135356903, 33.59540294893936],
                            [130.21840453147888, 33.59545210106014],
                            [130.21851181983948, 33.595492316410876],
                            [130.21853327751157, 33.59543869593907],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 9,
                name: '110',
                coordinate: {
                    lat: 33.59547444292398,
                    lng: 130.21855473518372,
                    },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21853327751157, 33.59543869593907],
                            [130.21851181983948, 33.595492316410876],
                            [130.21859765052795, 33.59551912663426],
                            [130.2186244726181, 33.595465506179146],
                          ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
        ],
        nodes: [],
        edges: [],
        bounds: {
            topL: {
                lat: 33.5954678,
                lng: 130.2177802,
            },
            botR: {
                lat: 33.5954678,
                lng: 130.2177802,
            },
        },
    },
    {
        id: 2,
        name: '総合学習プラザ 2F',
        floorName: '2F',
        spots: [
            {
                id: 10,
                name: '201',
                coordinate: {
                    lat: 33.59550125315293,
                    lng: 130.21782517433167,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21788418293, 33.59554593684934],
                            [130.21791100502014, 33.595487848039504],
                            [130.21780371665955, 33.59545210106014],
                            [130.21778225898743, 33.59551018989406],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 11,
                name: '202',
                coordinate: {
                    lat: 33.59553700011191,
                    lng: 130.2179378271103,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21800220012665, 33.595581683789796],
                            [130.2180290222168, 33.595523595004025],
                            [130.21791100502014, 33.595487848039504],
                            [130.21788418293, 33.59554593684934],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 12,
                name: '203',
                coordinate: {
                    lat: 33.595617430715414,
                    lng: 130.21824896335602,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21819531917572, 33.59563977253643],
                            [130.21821677684784, 33.59558615215631],
                            [130.21832406520844, 33.5956218990801],
                            [130.2182972431183, 33.59567551943798],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 13,
                name: '204',
                coordinate: {
                    lat: 33.5956487092632,
                    lng: 130.21834552288055,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2182972431183, 33.59567551943798],
                            [130.21832406520844, 33.5956218990801],
                            [130.218425989151, 33.595653177626254],
                            [130.21840453147888, 33.595706797964695],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 14,
                name: '205',
                coordinate: {
                    lat: 33.59568445616106,
                    lng: 130.2184635400772,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21840453147888, 33.595706797964695],
                            [130.218425989151, 33.595653177626254],
                            [130.21852254867554, 33.595679987799635],
                            [130.21849036216736, 33.59573360812144],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 17,
                name: '208',
                coordinate: {
                    lat: 33.595228682103595,
                    lng: 130.2179378271103,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2179217338562, 33.5951974034035],
                            [130.2179753780365, 33.5952152769478],
                            [130.2179592847824, 33.595251024025295],
                            [130.2179056406021, 33.595233150488404],
                            [130.2179217338562, 33.5951974034035],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 18,
                name: '209',
                coordinate: {
                    lat: 33.595251024025295,
                    lng: 130.21800220012665,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [

                            [130.21798074245453, 33.595219745333296],
                            [130.21803975105286, 33.59523761887296],
                            [130.21802365779877, 33.59527783432369],
                            [130.21796464920044, 33.59525996079234],
                            [130.21798074245453, 33.595219745333296],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 19,
                name: '210',
                coordinate: {
                    lat: 33.59527336594122,
                    lng: 130.218066573143,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21805584430695, 33.59524208725731],
                            [130.21809875965118, 33.59525549240893],
                            [130.2180826663971,  33.59530017623266],
                            [130.21803438663483, 33.595286771087984],
                            [130.21805584430695, 33.59524208725731],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 211,
                name: '211',
                coordinate: {
                    lat: 33.59532251813584,
                    lng: 130.21810948848724,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2181041240692, 33.59528677108796],
                            [130.21814703941348, 33.59530017623264],
                            [130.21813094615933, 33.59535379679057],
                            [130.21808266639712, 33.595344860033215],
                            [130.2181041240692, 33.59528677108796],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 212,
                name: '212',
                coordinate: {
                    lat: 33.59533145489548,
                    lng: 130.21816313266754,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21815240383148, 33.595304644613755],
                            [130.21820068359375, 33.59532251813584],
                            [130.21817922592163, 33.59536273354698],
                            [130.21813094615933, 33.59535379679057],
                            [130.21815240383148, 33.595304644613755],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 213,
                name: '213',
                coordinate: {
                    lat: 33.59534932841202,
                    lng: 130.2181899547577,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21818459033966, 33.59531804975566],
                            [130.21822750568393, 33.59533145489548],
                            [130.21821141242978, 33.595385075433946],
                            [130.21816313266754, 33.59537613867985],
                            [130.21818459033966, 33.59531804975566],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 214,
                name: '214',
                coordinate: {
                    lat: 33.59536273354698,
                    lng: 130.21823823451996,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2182275056839, 33.59533145489548],
                            [130.21827578544617, 33.59534039165423],
                            [130.21824896335602, 33.59540294893936],
                            [130.21820604801178, 33.59538954381066],
                            [130.2182275056839, 33.59533145489548],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 215,
                name: '215',
                coordinate: {
                    lat: 33.59538954381066,
                    lng: 130.2182811498642,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21827042102814, 33.59534932841202],
                            [130.21832406520844, 33.59536273354698],
                            [130.2182972431183, 33.59543869593907],
                            [130.218243598938, 33.59542082244106],
                            [130.21827042102814, 33.59534932841202],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 216,
                name: '216',
                coordinate: {
                    lat: 33.59540741731514,
                    lng: 130.21834015846252,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21832942962646, 33.59536720192484],
                            [130.21839380264282, 33.595380607057024],
                            [130.21836161613464, 33.595456569433374],
                            [130.21830260753632, 33.59543869593907],
                            [130.21832942962646, 33.59536720192484],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 217,
                name: '217',
                coordinate: {
                    lat: 33.59542975919055,
                    lng: 130.21839916706085,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2183884382248, 33.595385075433946],
                            [130.2184420824051, 33.59539848056336],
                            [130.21841526031494, 33.59547444292398],
                            [130.21836161613464, 33.595456569433374],
                            [130.2183884382248, 33.595385075433946],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 218,
                name: '218',
                coordinate: {
                    lat: 33.59545210106014,
                    lng: 130.21845817565918,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21844744682312, 33.59540741731514],
                            [130.21851181983948, 33.59542082244106],
                            [130.2184796333313, 33.59549678478202],
                            [130.21842062473297, 33.59547891129604],
                            [130.21844744682312, 33.59540741731514],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 219,
                name: '219',
                coordinate: {
                    lat: 33.595465506179146,
                    lng: 130.21852254867554,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2185171842575, 33.595425290815925],
                            [130.2185708284378, 33.59543869593907],
                            [130.21853864192963, 33.59550572152362],
                            [130.21849036216736, 33.595487848039504],
                            [130.2185171842575, 33.595425290815925],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 220,
                name: '220',
                coordinate: {
                    lat: 33.595487848039504,
                    lng: 130.21858155727386,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21856546401978, 33.595443164313],
                            [130.21862983703613, 33.595456569433374],
                            [130.21859765052795, 33.595532531742855],
                            [130.21853864192963, 33.595514658264285],
                            [130.21856546401978, 33.595443164313],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 15,
                name: '206',
                coordinate: {
                    lat: 33.59536273354698,
                    lng: 130.2179592847824,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2179056406021,  33.595291239469766],
                            [130.2180504798889,  33.59533592327497],
                            [130.21800756454468, 33.59543869593907],
                            [130.21786272525787, 33.59539401218712],
                            [130.2179056406021,  33.595291239469766],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 16,
                name: '207',
                coordinate: {
                    lat: 33.59557274705605,
                    lng: 130.2184957265854,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2184420824051,  33.59550572152362],
                            [130.2185869216919,  33.59554593684934],
                            [130.2185493707657,  33.59563530417269],
                            [130.21840453147888, 33.59559062052259],
                            [130.2184420824051,  33.59550572152362],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
        ],
        nodes: [],
        edges: [],
        bounds: {
            topL: {
                lat: 33.5954678,
                lng: 130.2177802,
            },
            botR: {
                lat: 33.5954678,
                lng: 130.2177802,
            },
        },
    },
    {
        id: 3,
        name: 'ウエスト2号館 2F',
        floorName: '2F',
        spots: [
            {
                id: 201,
                name: '201',
                coordinate: {
                    lat: 33.59605532935213,
                    lng: 130.218066573143,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2181738615036, 33.59611341777977],
                            [130.21819531917572, 33.596046392667475],
                            [130.2179753780365, 33.59599277254014],
                            [130.21794855594635, 33.59605979769412],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 202,
                name: '202',
                coordinate: {
                    lat: 33.59611341777977,
                    lng: 130.2183562517166,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2183884382248, 33.59616703783212],
                            [130.2184098958969, 33.5960955444216],
                            [130.21834015846252, 33.59609107608145],
                            [130.2183187007904, 33.596153632822144],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 203,
                name: '203',
                coordinate: {
                    lat: 33.59615810115904,
                    lng: 130.21890878677368,
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 204,
                name: '204',
                coordinate: {
                    lat: 33.59618937951075,
                    lng: 130.2190536260605,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21915555000305, 33.59624746784811],
                            [130.21916091442108, 33.59616256949568],
                            [130.21889805793762, 33.59614916448504],
                            [130.21888732910156, 33.59622512618452],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 205,
                name: '205',
                coordinate: {
                    lat: 33.595827443604335,
                    lng: 130.21771252155304,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21763741970062, 33.5958453170181],
                            [130.21775543689728, 33.595890000536244],
                            [130.21780371665955, 33.595818506896094],
                            [130.21768569946286, 33.59577829169747],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 206,
                name: '206',
                coordinate: {
                    lat: 33.59574254483849,
                    lng:  130.21777153015137,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21768569946286, 33.59577829169747],
                            [130.21780371665955, 33.595818506896094],
                            [130.2178680896759, 33.59572467140345],
                            [130.21775007247925, 33.595679987799635],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 207,
                name: '207',
                coordinate: {
                    lat: 33.59575594991233,
                    lng: 130.21794855594635,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21790027618408, 33.595818506896094],
                            [130.2179378271103, 33.59573807648007],
                            [130.2180451154709, 33.59576935498411],
                            [130.21800220012665, 33.59585425372357],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 208,
                name: '208',
                coordinate: {
                    lat: 33.59580510183197,
                    lng: 130.2179753780365,
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 209,
                name: '情報学習室-1',
                coordinate: {
                    lat: 33.595867658780065,
                    lng: 130.21834552288055,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21847426891327, 33.59584978537095],
                            [130.2184420824051, 33.59593915237948],
                            [130.21822214126587, 33.59588106383446],
                            [130.21824896335602, 33.59580063347678],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 210,
                name: '情報学習室-2',
                coordinate: {
                    lat: 33.59593468403126,
                    lng: 130.21873712539673,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21881222724915, 33.5959883041947],
                            [130.2188390493393, 33.595903405587165],
                            [130.21867275238037, 33.59587659548322],
                            [130.21864593029022, 33.59596149411714],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
        ],
        nodes: [],
        edges: [],
        bounds: {
            topL: {
                lat: 33.596314492804154,
                lng: 130.2175408601761,
            },
            botR: {
                lat: 33.59563530417269,
                lng: 130.2193433046341,
            },
        },
    },
    {
        id: 4,
        name: 'ウエスト2号館 3F',
        floorName: '3F',
        spots: [
            {
                id: 301,
                name: '301',
                coordinate: {
                    lat: 33.59594808907523,
                    lng: 130.2177232503891,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2176535129547, 33.596006177575106],
                            [130.21768569946286, 33.595890000536244],
                            [130.2177929878235, 33.59591234228663],
                            [130.2177661657333, 33.5960240509518],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 302,
                name: '302',
                coordinate: {
                    lat: 33.595983835849026,
                    lng: 130.21791100502014,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2178305387497, 33.5960374559819],
                            [130.21785736083984, 33.59592574733411],
                            [130.21800220012665, 33.59595255742276],
                            [130.2179753780365, 33.596064266035846],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 303,
                name: '303',
                coordinate: {
                    lat: 33.596006177575106,
                    lng: 130.2180290222168,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2179753780365, 33.596064266035846],
                            [130.21800220012665, 33.59595255742276],
                            [130.2180826663971, 33.595970430810574],
                            [130.2180451154709, 33.59607767105969],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 304,
                name: '304',
                coordinate: {
                    lat: 33.596028519295416,
                    lng: 130.2181202173233,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2180451154709, 33.59607767105969],
                            [130.2180826663971, 33.595970430810574],
                            [130.21819531917572, 33.59599724088536],
                            [130.2181577682495, 33.59610448110114],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 305,
                name: '305',
                coordinate: {
                    lat: 33.59605979769412,
                    lng: 130.21825432777405,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2181577682495, 33.59610448110114],
                            [130.21819531917572, 33.59599724088536],
                            [130.21834552288055, 33.59603298763877],
                            [130.21830797195435, 33.59614469614769],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 306,
                name: '306',
                coordinate: {
                    lat: 33.59610448110114,
                    lng: 130.21844744682312,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2184098958969, 33.59615810115904],
                            [130.21843135356903, 33.59605086100992],
                            [130.21848499774933, 33.59605979769412],
                            [130.2184635400772, 33.59616703783212],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3071,
                name: '307-1',
                coordinate: {
                    lat: 33.596122354457485,
                    lng: 130.2185708284378,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2184635400772, 33.59616703783212],
                            [130.21848499774933, 33.59605979769412],
                            [130.21868348121643, 33.596086607741114],
                            [130.2186620235443, 33.59619831618057],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3072,
                name: '307-2',
                coordinate: {
                    lat: 33.596175974504256,
                    lng: 130.21868884563446,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2186620235443, 33.59619831618057],
                            [130.21868348121643, 33.596086607741114],
                            [130.2187317609787, 33.5960955444216],
                            [130.21871030330658, 33.596207252849474],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3073,
                name: '307-3',
                coordinate: {
                    lat: 33.596117886118755,
                    lng: 130.21869957447052,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 309,
                name: '309',
                coordinate: {
                    lat: 33.596175974504256,
                    lng: 130.21880686283112,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2187693119049, 33.5962117211836],
                            [130.218785405159, 33.59614469614769],
                            [130.21884441375732, 33.596153632822144],
                            [130.21882832050323, 33.596220657851106],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 310,
                name: '310',
                coordinate: {
                    lat: 33.59618491117548,
                    lng: 130.21886587142944,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21882832050323, 33.596220657851106],
                            [130.21884441375732, 33.596153632822144],
                            [130.21890342235565, 33.59616256949568],
                            [130.21888732910156, 33.596234062850655],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 311,
                name: '311',
                coordinate: {
                    lat: 33.59619384784579,
                    lng: 130.2189141511917,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21888732910156, 33.596234062850655],
                            [130.21890342235565, 33.59616256949568],
                            [130.21894097328186, 33.59616703783212],
                            [130.21892488002777, 33.596238531183374],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 312,
                name: '312',
                coordinate: {
                    lat: 33.59620278451515,
                    lng: 130.21896243095398,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21892488002777, 33.596238531183374],
                            [130.21894097328186, 33.59616703783212],
                            [130.21899461746216, 33.596171506168304],
                            [130.2189838886261, 33.59624746784811],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 313,
                name: '313',
                coordinate: {
                    lat: 33.59620278451515,
                    lng: 130.21908044815063,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21899461746216, 33.596153632822144],
                            [130.2189838886261, 33.59624746784811],
                            [130.21917164325714, 33.59626534117481],
                            [130.2191823720932, 33.59616703783212],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 314,
                name: '314',
                coordinate: {
                    lat: 33.5962117211836,
                    lng: 130.2192199230194,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21917164325714, 33.59626534117481],
                            [130.2191823720932, 33.59616703783212],
                            [130.21926283836365, 33.596171506168304],
                            [130.2192574739456, 33.5962698095059],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 315,
                name: '315',
                coordinate: {
                    lat: 33.59583638031169,
                    lng: 130.21780908107755,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21775543689728, 33.595773823340906],
                            [130.2179056406021, 33.59581403854161],
                            [130.2178680896759, 33.59590787393704],
                            [130.21771252155304, 33.59587659548322],
                            [130.21775543689728, 33.595773823340906],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3161,
                name: '316-1',
                coordinate: {
                    lat: 33.596086607741114,
                    lng: 130.21917164325714,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21908044815063, 33.5960374559819],
                            [130.2192574739456, 33.59605086100992],
                            [130.2192574739456, 33.5961402278101],
                            [130.21910190582275, 33.5961402278101],
                            [130.21908044815063, 33.5960374559819],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3162,
                name: '316-2',
                coordinate: {
                    lat: 33.596122354457485,
                    lng: 130.21912336349487,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 3163,
                name: '316-3',
                coordinate: {
                    lat: 33.59605979769412,
                    lng: 130.2191126346588,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 317,
                name: '317',
                coordinate: {
                    lat: 33.59572913976256,
                    lng: 130.21785736083984,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2177929878235, 33.59573807648007],
                            [130.21782517433167, 33.59566211435165],
                            [130.21792709827423, 33.59569339288322],
                            [130.21789491176605, 33.595773823340906],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 318,
                name: '318',
                coordinate: {
                    lat: 33.59575148155462,
                    lng: 130.21796464920044,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21789491176605, 33.595773823340906],
                            [130.21792709827423, 33.59569339288322],
                            [130.21803438663483, 33.59572467140345],
                            [130.21800220012665, 33.59580510183197],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 319,
                name: '319',
                coordinate: {
                    lat: 33.595827443604335,
                    lng: 130.2182650566101,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21821141242978, 33.595863190428126],
                            [130.21823823451996, 33.59578722840988],
                            [130.2183187007904, 33.59580957018691],
                            [130.21829187870023, 33.595885532185456],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 320,
                name: '320',
                coordinate: {
                    lat: 33.59584978537095,
                    lng: 130.21834015846252,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21829187870023, 33.595885532185456],
                            [130.2183187007904, 33.59580957018691],
                            [130.2183884382248, 33.595827443604335],
                            [130.21836161613464, 33.595903405587165],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 321,
                name: '321',
                coordinate: {
                    lat: 33.59587659548322,
                    lng: 130.21845281124112,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21840453147888, 33.59591681063602],
                            [130.21843135356903, 33.595840848665],
                            [130.2184957265854, 33.59585872207597],
                            [130.21846890449524, 33.59593468403126],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 322,
                name: '322',
                coordinate: {
                    lat: 33.59589893723709,
                    lng: 130.21861374378202,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21857619285583, 33.59593915237948],
                            [130.21859228610992, 33.595867658780065],
                            [130.21865129470825, 33.59587659548322],
                            [130.21863520145416, 33.59595255742276],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 323,
                name: '323',
                coordinate: {
                    lat: 33.59591681063602,
                    lng: 130.21870493888855,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2186620235443, 33.59595702577006],
                            [130.2186781167984, 33.59588106383446],
                            [130.2187478542328, 33.595890000536244],
                            [130.2187317609787, 33.595970430810574],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 324,
                name: '324',
                coordinate: {
                    lat: 33.595930215682785,
                    lng: 130.2187746763229,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2187317609787, 33.595970430810574],
                            [130.2187478542328, 33.595890000536244],
                            [130.2188229560852, 33.59589893723709],
                            [130.21880686283112, 33.595983835849026],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 325,
                name: '325',
                coordinate: {
                    lat: 33.59595255742276,
                    lng: 130.21897315979004,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2189302444458, 33.59599724088536],
                            [130.2189356088638, 33.59590787393704],
                            [130.21901607513425, 33.59591681063602],
                            [130.21901071071625, 33.59600170923035],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 326,
                name: '326',
                coordinate: {
                    lat: 33.59595255742276,
                    lng: 130.21904826164246,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21901071071625, 33.59600170923035],
                            [130.21901607513425, 33.59591681063602],
                            [130.21908581256866, 33.59592127898518],
                            [130.21908044815063, 33.596006177575106],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 327,
                name: '327',
                coordinate: {
                    lat: 33.59596149411714,
                    lng: 130.21913945674896,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21910190582275, 33.596006177575106],
                            [130.21910727024078, 33.59592127898518],
                            [130.21917164325714, 33.59592127898518],
                            [130.2191662788391, 33.596010645919634],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 328,
                name: '328',
                coordinate: {
                    lat: 33.59596149411714,
                    lng: 130.2191984653473,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2191662788391, 33.596010645919634],
                            [130.21917164325714, 33.59592127898518],
                            [130.2192360162735, 33.59592574733411],
                            [130.21923065185547, 33.59601511426391],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
        ],
        nodes: [],
        edges: [],
        bounds: {
            topL: {
                lat: 33.596314492804154,
                lng: 130.2175408601761,
            },
            botR: {
                lat: 33.59563530417269,
                lng: 130.2193433046341,
            },
        },
    },
    {
        id: 6,
        name: 'ウエスト2号館 5F',
        floorName: '5F',
        spots: [
            {
                id: 501,
                name: '501',
                coordinate: {
                    lat: 33.59595255742276,
                    lng: 130.21762132644653,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21757304668427, 33.59599277254014],
                            [130.21760523319242, 33.59591904481062],
                            [130.21767765283585, 33.5959413865535],
                            [130.21764814853665, 33.5960084117474],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 502,
                name: '502',
                coordinate: {
                    lat: 33.595974899156964,
                    lng: 130.217707157135,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21764814853665, 33.5960084117474],
                            [130.21767765283585, 33.5959413865535],
                            [130.21777153015137, 33.59596149411714],
                            [130.21775007247925, 33.59603298763877],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 5031,
                name: '503-1',
                coordinate: {
                    lat: 33.59601958260798,
                    lng: 130.2177929878235,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21775007247925, 33.59603298763877],
                            [130.21777153015137, 33.59596149411714],
                            [130.2178519964218, 33.59597713333007],
                            [130.2178332209587, 33.59604415849618],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 5032,
                name: '503-2',
                coordinate: {
                    lat: 33.59597936750309,
                    lng: 130.21780908107755,
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 504,
                name: '504',
                coordinate: {
                    lat: 33.59601958260798,
                    lng: 130.21787881851196,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2178332209587, 33.59604415849618],
                            [130.2178519964218, 33.59597713333007],
                            [130.2179217338562, 33.595990538367445],
                            [130.21790027618408, 33.59605756352315],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 505,
                name: '505',
                coordinate: {
                    lat: 33.5960419243248,
                    lng: 130.21798610687256,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21790027618408, 33.59605756352315],
                            [130.2179217338562, 33.595990538367445],
                            [130.218063890934, 33.59602628512363],
                            [130.21803975105286, 33.596086607741114],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 506,
                name: '506',
                coordinate: {
                    lat: 33.596064266035846,
                    lng: 130.2181363105774,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21803975105286, 33.596086607741114],
                            [130.218063890934, 33.59602628512363],
                            [130.21823287010193, 33.59605979769412],
                            [130.2182087302208, 33.59612682279598],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 507,
                name: '507',
                coordinate: {
                    lat: 33.5960955444216,
                    lng: 130.2182972431183,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2182087302208, 33.59612682279598],
                            [130.21823287010193, 33.59605979769412],
                            [130.21837502717972, 33.596086607741114],
                            [130.2183535695076, 33.59615139865362],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 508,
                name: '508',
                coordinate: {
                    lat: 33.59612682279598,
                    lng: 130.21844744682312,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2183535695076, 33.59615139865362],
                            [130.21837502717972, 33.596086607741114],
                            [130.21853327751157, 33.59611565194929],
                            [130.21851986646652, 33.59618267700777],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 509,
                name: '509',
                coordinate: {
                    lat: 33.596153632822144,
                    lng: 130.218608379364,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21851986646652, 33.59618267700777],
                            [130.21853327751157, 33.59611565194929],
                            [130.2186781167984, 33.5961402278101],
                            [130.21866738796234, 33.59620278451515],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 510,
                name: '510',
                coordinate: {
                    lat: 33.59616703783212,
                    lng: 130.2187478542328,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21866738796234, 33.59620278451515],
                            [130.2186781167984, 33.5961402278101],
                            [130.21881222724915, 33.596164803663925],
                            [130.2188014984131, 33.596227360351136],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 511,
                name: '511',
                coordinate: {
                    lat: 33.59619831618057,
                    lng: 130.21887123584747,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2188014984131, 33.596227360351136],
                            [130.21881222724915, 33.596164803663925],
                            [130.21893829107285, 33.59617374033632],
                            [130.2189302444458, 33.596242999515844],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 512,
                name: '512',
                coordinate: {
                    lat: 33.5962117211836,
                    lng: 130.21898925304413,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2189302444458, 33.596242999515844],
                            [130.21893829107285, 33.59617374033632],
                            [130.21905094385147, 33.59618491117548],
                            [130.2190402150154, 33.59625640451193],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 513,
                name: '513',
                coordinate: {
                    lat: 33.59622512618452,
                    lng: 130.21908581256866,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2190402150154, 33.59625640451193],
                            [130.21905094385147, 33.59618491117548],
                            [130.2191260457039, 33.59619384784579],
                            [130.21912336349487, 33.59626310700918],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 514,
                name: '514',
                coordinate: {
                    lat: 33.5962295945177,
                    lng: 130.21916091442108,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21912336349487, 33.59626310700918],
                            [130.2191260457039, 33.59619384784579],
                            [130.21919310092926, 33.59619608201319],
                            [130.21919310092926, 33.59626534117481],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 515,
                name: '515',
                coordinate: {
                    lat: 33.59584978537095,
                    lng: 130.21769642829895,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21763741970062, 33.59584978537095],
                            [130.2176696062088, 33.59580957018691],
                            [130.21775007247925, 33.5958453170181],
                            [130.21773397922516, 33.595885532185456],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 516,
                name: '516',
                coordinate: {
                    lat: 33.595885532185456,
                    lng: 130.2177608013153,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21773397922516, 33.595885532185456],
                            [130.21774470806122, 33.59585872207597],
                            [130.2177929878235, 33.59587659548322],
                            [130.2177768945694, 33.59590787393704],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 517,
                name: '517',
                coordinate: {
                    lat: 33.59578276005378,
                    lng: 130.2177232503891,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2176696062088, 33.59580957018691],
                            [130.217707157135, 33.59574701319666],
                            [130.21778225898743, 33.59576935498411],
                            [130.21775007247925, 33.5958453170181],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 518,
                name: '518',
                coordinate: {
                    lat: 33.59581403854161,
                    lng: 130.21778225898743,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21774470806122, 33.59585872207597],
                            [130.2177929878235, 33.59587659548322],
                            [130.2178305387497, 33.59577829169747],
                            [130.21778225898743, 33.59576935498411],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 519,
                name: '519',
                coordinate: {
                    lat: 33.59585425372357,
                    lng: 130.2179217338562,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2179056406021, 33.595818506896094],
                            [130.21796464920044, 33.59583191195813],
                            [130.21794855594635, 33.595890000536244],
                            [130.21787881851196, 33.59587212713177],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 520,
                name: '520',
                coordinate: {
                    lat: 33.59587659548322,
                    lng: 130.21806120872498,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2180826663971, 33.59590787393704],
                            [130.2180290222168, 33.59589893723709],
                            [130.2180451154709, 33.5958453170181],
                            [130.21809875965118, 33.59585872207597],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 521,
                name: '521',
                coordinate: {
                    lat: 33.59591681063602,
                    lng: 130.21811485290527,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21809875965118, 33.59585425372357],
                            [130.21817922592163, 33.595867658780065],
                            [130.21814167499542, 33.595983835849026],
                            [130.218066573143, 33.59596149411714],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 522,
                name: '522',
                coordinate: {
                    lat: 33.59595255742276,
                    lng: 130.218243598938,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2182275056839, 33.59591681063602],
                            [130.21828651428223, 33.59592574733411],
                            [130.21825969219208, 33.596010645919634],
                            [130.21820068359375, 33.59599277254014],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 523,
                name: '523',
                coordinate: {
                    lat: 33.59590787393704,
                    lng: 130.2182811498642,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2182275056839, 33.59591681063602],
                            [130.21823823451996, 33.595885532185456],
                            [130.21834015846252, 33.59589446888678],
                            [130.21832942962646, 33.59594362072747],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 524,
                name: '524',
                coordinate: {
                    lat: 33.595974899156964,
                    lng: 130.21851181983948,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21853864192963, 33.596064266035846],
                            [130.21855473518372, 33.59594808907523],
                            [130.21841526031494, 33.595930215682785],
                            [130.2184098958969, 33.595974899156964],
                            [130.21849036216736, 33.59597936750309],
                            [130.21847426891327, 33.596064266035846],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 525,
                name: '525',
                coordinate: {
                    lat: 33.5960419243248,
                    lng: 130.21865129470825,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21861910820007, 33.596006177575106],
                            [130.21870493888855, 33.59601511426391],
                            [130.21869421005246, 33.596086607741114],
                            [130.218608379364, 33.59607320271865],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 526,
                name: '526',
                coordinate: {
                    lat: 33.59596149411714,
                    lng: 130.2186781167984,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21861910820007, 33.596006177575106],
                            [130.21870493888855, 33.59601511426391],
                            [130.21871030330658, 33.595981601676094],
                            [130.2187746763229, 33.595990538367445],
                            [130.21878272294998, 33.59595255742276],
                            [130.2186244726181, 33.595930215682785],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 527,
                name: '527',
                coordinate: {
                    lat: 33.59599724088536,
                    lng: 130.2189302444458,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.2189141511917, 33.595972664983805],
                            [130.218967795372, 33.59597936750309],
                            [130.21895706653595, 33.59601734843597],
                            [130.21890342235565, 33.5960084117474],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 528,
                name: '528',
                coordinate: {
                    lat: 33.596108949440584,
                    lng: 130.2190375328064,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21900534629822, 33.59613129113425],
                            [130.21901607513425, 33.59607320271865],
                            [130.21906971931458, 33.59608213940053],
                            [130.21906435489655, 33.5961402278101],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 529,
                name: '529',
                coordinate: {
                    lat: 33.59605532935213,
                    lng: 130.21904826164246,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21901607513425, 33.59607320271865],
                            [130.21903216838837, 33.59601958260798],
                            [130.21908581256866, 33.596028519295416],
                            [130.21906971931458, 33.59608213940053],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 5301,
                name: '530-1',
                coordinate: {
                    lat: 33.596064266035846,
                    lng: 130.2190965414047,
                },
                shape: {
                    type: 'Polygon',
                    coordinates: [
                        [
                            [130.21903216838837, 33.59601958260798],
                            [130.21908581256866, 33.596028519295416],
                            [130.21906971931458, 33.59608213940053],
                            [130.21906435489655, 33.5961402278101],
                            [130.21917700767514, 33.59614916448504],
                            [130.21920919418335, 33.596010645919634],
                            [130.21904289722443, 33.595983835849026],
                        ],
                    ],
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 5302,
                name: '530-2',
                coordinate: {
                    lat: 33.59612682279598,
                    lng: 130.21913945674896,
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
            {
                id: 5303,
                name: '530-3',
                coordinate: {
                    lat: 33.59601958260798,
                    lng: 130.21915018558502,
                },
                gateNodeIds: [],
                detailMapIds: [],
                detailMapLevelNames: [],
                lastViewedDetailMapId: null,
            },
        ],
    nodes: [],
    edges: [],
    bounds: {
        topL: {
            lat: 33.596314492804154,
            lng: 130.2175408601761,
        },
        botR: {
            lat: 33.59563530417269,
            lng: 130.2193433046341,
        },
    },
},
];
